final-project/simulationPotential/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
4432
(
(40.0009 3.88932e-06 -0.000925915)
(40.0028 2.17977e-06 -0.000963691)
(40.0048 1.94067e-06 -0.00103837)
(40.0069 1.94835e-06 -0.00115272)
(40.0094 2.0008e-06 -0.0013099)
(40.0122 2.06467e-06 -0.00151378)
(40.0154 2.1374e-06 -0.00176853)
(40.0193 2.22526e-06 -0.0020788)
...
)
;

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (40 0 0);
        value           uniform (40 0 0);
    }
    outlet
    {
        type            freestream;
        freestreamValue uniform (40 0 0);
        value           nonuniform List<vector> 
60
(
(40.0021 2.23106e-08 2.7264e-05)
(40.0021 2.23106e-08 2.72739e-05)
(40.002 3.22117e-08 8.06727e-05)
(40.002 3.22117e-08 8.06878e-05)
(40.0018 3.73846e-08 0.000130715)
(40.0018 3.73846e-08 0.000130723)
(40.0015 3.9884e-08 0.000175258)
(40.0015 3.9884e-08 0.00017527)
...
)
;
    }
    rightSide
    {
        type            symmetryPlane;
    }
    leftSide
    {
        type            symmetryPlane;
    }
    duct
    {
        type            noSlip;
    }
    cylinder
    {
        type            noSlip;
    }
}


// ************************************************************************* //
