final-project/simulationPotential/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
11516
(
1.00005e+07
1.94466
-462.957
1.00009e+07
1.08988
-481.845
1.00014e+07
0.970333
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
-1e+07
-1e+07
-1e+07
-1e+07
-1e+07
-1e+07
-1e+07
-1e+07
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
1.00005e+07
1.00005e+07
1.00005e+07
1.00005e+07
1.00004e+07
1.00004e+07
1.00004e+07
1.00004e+07
...
)
;
    }
    rightSide
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    leftSide
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    duct
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           uniform -0;
    }
}


// ************************************************************************* //
